In [3]:
import pandas as pd
import numpy as np

In [8]:
weatherDict ={"İstanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "İzmir": [40,39,38], "Antalya": [45,np.nan,np.nan]}
newDataFrame = pd.DataFrame(weatherDict)
newDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [9]:
#Clear the all nan
newDataFrame.dropna()

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0

In [15]:
#Clear the all none which greater than 2
newDataFrame.dropna(axis=1, thresh=2)

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [16]:
#Fill all nan datas
newDataFrame.fillna(20)

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# groupBy

In [17]:
salaryDict = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
             "Names" : ["Soner","Hatice","Eren","Nuri","Hacer","Süleyman"],
             "Salary" : [1000,1000,100,200,300,400]}
salaryDF = pd.DataFrame(salaryDict)
salaryDF

   Departman     Names  Salary
0    Yazılım     Soner    1000
1    Yazılım    Hatice    1000
2  Pazarlama      Eren     100
3  Pazarlama      Nuri     200
4      Hukuk     Hacer     300
5      Hukuk  Süleyman     400

In [32]:
#grouping with departman
departmanGroups = salaryDF.groupby("Departman")

In [33]:
#count
departmanGroups.count()

           Names  Salary
Departman
Hukuk          2       2
Pazarlama      2       2
Yazılım        2       2

In [36]:
#Take means
departmanGroups.mean("Salary")

           Salary
Departman
Hukuk       350.0
Pazarlama   150.0
Yazılım    1000.0

In [40]:
#
departmanGropus.max()

              Names  Salary
Departman
Hukuk      Süleyman     400
Pazarlama      Nuri     200
Yazılım       Soner    1000

In [38]:
#Describe
departmanGropus.describe()

          Salary
           count    mean        std     min     25%     50%     75%     max
Departman
Hukuk        2.0   350.0  70.710678   300.0   325.0   350.0   375.0   400.0
Pazarlama    2.0   150.0  70.710678   100.0   125.0   150.0   175.0   200.0
Yazılım      2.0  1000.0   0.000000  1000.0  1000.0  1000.0  1000.0  1000.0

In [42]:
sozluk1 = {"Name" : ["Soner","Hatice","Nuri","Hacer"],
          "Sport" : ["Tennis","Football","Golf","Paintball"],
          "Calori" :[100,200,300,400]}
sozluk2 = {"Name" : ["Ali","Veli","Hasan","Hüseyin"],
          "Sport" : ["Tennis","Football","Golf","Paintball"],
          "Calori" :[150,120,240,180]}
sozluk3 = {"Name" : ["Cüneyt","Süleyman","Buğra","Mustafa"],
          "Sport" : ["Tennis","Football","Golf","Paintball"],
          "Calori" :[30,40,50,60]}

dF1 = pd.DataFrame(sozluk1,index = [1,2,3,4])
dF2 = pd.DataFrame(sozluk2,index = [1,2,3,4])
dF3 = pd.DataFrame(sozluk3,index = [1,2,3,4])

In [43]:
#Concatanation
dFGeneral = pd.concat([dF1,dF2,dF3])
dFGeneral

       Name      Sport  Calori
1     Soner     Tennis     100
2    Hatice   Football     200
3      Nuri       Golf     300
4     Hacer  Paintball     400
1       Ali     Tennis     150
2      Veli   Football     120
3     Hasan       Golf     240
4   Hüseyin  Paintball     180
1    Cüneyt     Tennis      30
2  Süleyman   Football      40
3     Buğra       Golf      50
4   Mustafa  Paintball      60

# Merge

In [45]:
mergeDict1 ={"Name" : ["Ahmet","Mehmet","Zeynep","Atıl"],
            "Sport" : ["Football","Tennis","Golf","Karate"]}
mergeDict2 ={"Name" : ["Ahmet","Mehmet","Zeynep","Atıl"],
            "Calori" : [100,200,300,400]}
mergeDataFrame = pd.DataFrame(mergeDict1)
mergeDataFrame2 = pd.DataFrame(mergeDict2)

In [46]:
#Merging columns
pd.merge(mergeDataFrame,mergeDataFrame2, on = "Name")

     Name     Sport  Calori
0   Ahmet  Football     100
1  Mehmet    Tennis     200
2  Zeynep      Golf     300
3    Atıl    Karate     400

In [56]:
maasSozluk = {"Names" : ["Soner","Hatice","Eren","Nuri"],
            "Departman" : ["Yazılım","Yazılım","Pazarlama","Hukuk"],
             "Maas" : [1000,200,300,400]}
maasDataFrame = pd.DataFrame(maasSozluk)

#Bring uniques
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Pazarlama', 'Hukuk'], dtype=object)

In [49]:
#unique number
maasDataFrame["Departman"].nunique()

3

In [50]:
#Bring values
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Pazarlama    1
Hukuk        1
Name: count, dtype: int64

In [60]:
#Apply the def
def buruttenNete(Maas):
    return Maas * 0.66
maasDataFrame["Maas"].apply(buruttenNete)

0    660.0
1    132.0
2    198.0
3    264.0
Name: Maas, dtype: float64

In [61]:
maasDataFrame.isnull()

   Names  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [66]:
salaryDict = {"Departman" : ["Yazılım","Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
             "Names" : ["Soner","Hatice","Hatice","Eren","Nuri","Hacer","Süleyman"],
             "Salary" : [1000,1000,2000,100,200,300,400]}
characterDF = pd.DataFrame(salaryDict)
characterDF

   Departman     Names  Salary
0    Yazılım     Soner    1000
1    Yazılım    Hatice    1000
2    Yazılım    Hatice    2000
3  Pazarlama      Eren     100
4  Pazarlama      Nuri     200
5      Hukuk     Hacer     300
6      Hukuk  Süleyman     400

In [67]:
#Specification on the table
characterDF.pivot_table(values = "Salary", index = ["Departman","Names"])

                    Salary
Departman Names
Hukuk     Hacer      300.0
          Süleyman   400.0
Pazarlama Eren       100.0
          Nuri       200.0
Yazılım   Hatice    1500.0
          Soner     1000.0

In [74]:
characterDF.pivot_table(values = "Salary", index = ["Departman","Names"],aggfunc=np.sum)

/var/folders/lr/2ldxzsr108x9qnplpstb554m0000gn/T/ipykernel_22731/3233513356.py:1: FutureWarning: The provided callable <function sum at 0x106e6b9c0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  characterDF.pivot_table(values = "Salary", index = ["Departman","Names"],aggfunc=np.sum)

                    Salary
Departman Names
Hukuk     Hacer        300
          Süleyman     400
Pazarlama Eren         100
          Nuri         200
Yazılım   Hatice      3000
          Soner       1000